cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'osx-cross/arm'

# cmd tools
brew 'aria2'		# torrent/download tool
brew 'aws-cdk'
brew 'awscli'
brew 'fzf'		# search tool
brew 'gettext'
brew 'gh'
brew 'git-lfs'
brew 'htop'		# task monitoring
brew 'jq'		# json formatter
brew 'neovim'		# cli editor
brew 'pyenv'		# python environment helper tool
brew 'tmux'		# cli manager
brew 'tree'

# compiler tools
brew 'libusb'
brew 'node@20'
# brew 'open-ocd'
brew 'protobuf'
brew 'scons'

# database tools
brew 'libpq'  # psql tools
brew 'mssql-tools'
brew 'sqlite'


# applications
cask 'amazon-chime'
cask 'android-platform-tools'
cask 'android-studio'
cask 'arduino-ide'
cask 'bruno'
cask 'coolterm'
cask 'dbeaver-community'
cask 'docker-desktop'
cask 'drawio'
cask 'font-jetbrains-mono-nerd-font'
# cask 'gcc-arm-embedded'
cask 'iterm2'
cask 'nrf-connect'
cask 'postman'
cask 'pycharm-ce'
cask 'sensiblesidebuttons'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'
