cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'osx-cross/arm'

# cmd tools
brew 'aria2' # torrent/download tool
brew 'aws-cdk'
brew 'awscli'
brew 'gettext'
brew 'gh'
brew 'git-lfs'
brew 'htop'
brew 'jq'
brew 'node@20'
brew 'nvim'
brew 'pyenv'
brew 'tmux'
brew 'tree'

# compiler tools
brew 'libusb'
brew 'protobuf'
brew 'scons'

# database tools
brew 'libpq'  # psql tools
brew 'mssql-tools'
brew 'sqlite'

cask 'amazon-chime'
cask 'android-platform-tools'
cask 'android-studio'
cask 'arduino-ide'
cask 'chatgpt'
cask 'coolterm'
cask 'dbeaver-community'
cask 'docker'
cask 'drawio'
cask 'font-jetbrains-mono-nerd-font'
# cask 'gcc-arm-embedded'
# cask 'hiddenbar'
cask 'iterm2'
cask 'nrf-connect'
cask 'postman'
cask 'pycharm-ce'
cask 'sensiblesidebuttons'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'
